// Copyright © 2021 Ni Fu. All rights reserved.

import Foundation

class ContentResource {
    
    let currencies = ["$", "¢", "£", "¥", "؋", "৳", "₠", "૱", "௹", "฿"]
    
    let emoticons = ["ヾ(ﾟдﾟ)ﾉ゛", "ヽ(ﾟω､ﾟ)ﾉ", "ヾ(o´∀`o)ﾉ", "ヽ(･ω･´ﾒ)", "ヾ(●´∀`●)",
                    "ヾ(=･ω･=)o", "ヽ(´Ａ`)ﾉ", "ヽ(´ｰ`)ﾉ", "ヽ(;´Д`)ﾉ", "ヾ(*ﾟω∩*)",
                    "彡(-_-;)彡", "(((ﾟДﾟ)))", "ﾉ)ﾟДﾟ(ヽ", "つ;´･ω-)つ", "щ(`ω´щ)",
                    "Ψ(`∀´)Ψ", "ΣΣ(ﾟдﾟlll)!", "Σ(ﾟДﾟ;≡;ﾟдﾟ)", "(;:ﾟ:ж:ﾟ:;)", "(｡-д-｡)ゞ",
                    "(*´～`*)", "(´;ω;`)", "m(_ _)m", "《(;´Д`)》", "～(´ｰ`～)",
                    "((((；ﾟДﾟ))))ｶﾞｸｶﾞｸﾌﾞﾙﾌﾞﾙ", "(((;°Д°;))))", "((.;ﾟ;:Д:;ﾟ;.))", "(*°ρ°*)", "_:(´ཀ`」 ∠):_",
                    "_(:o 」∠)_", "(╯•ω•╰) I’m sorry…", "(´･_･人)", "ｳﾜｧｧ━━━｡ﾟ(ﾟ´Д｀ﾟ)ﾟ｡━━━ﾝ!!!!", "ｷﾀ━━━━(ﾟ∀ﾟ)━━━━!!",
                    "きゃ━(;´༎ຶД༎ຶ`)━っっ!!!", ":;((っ°ө°ｃ));:", "ﾆﾔﾆﾔ(°∀° )ﾆﾔﾆﾔ", "(； ･`ω･´)ﾅﾝ…ﾀﾞﾄ!?", "∑( ◦д⊙)!!",
                    "∑Σ( °∀°ﾉ)ﾉ", "ｱﾜ((ﾟﾟддﾟﾟ ))ﾜﾜ!!", "(・∀・)Good!!", "(´-﹏-`；)", "(๑･﹃ ･｀๑)ｼﾞｭﾙﾘ",
                    "‹‹\\(´ω` )/››‹‹\\( 　´)/›› ‹‹\\( ´ω`)/››~♪", "(・(・(・(・д・)・)・)・) ﾌﾞﾝｼｰﾝ!!",
                    "₍₍⁽⁽(ง ˙o˙)ว₎₎⁾⁾ ｳﾎﾎ ｳﾎ", "へ(ﾟ∀ﾟへ)ｵﾊﾞｹｪ～", "(((ง’ω’)و三 ง’ω’)ڡ≡ｼｭｯｼｭ", "─=≡Σ((( つ•̀ω•́)つ",
                    "┏┗(´ิq´ิ)┓┛ｷｪｪｪｪｨｲｲｲｲｲ", "(‘ω’)三(ε: )三(.ω.)三( :3 )三(‘ω’)", "(`･ω･´)ゞﾋﾞｼｯ!!"]
}
